DesignPattern/c-singleton.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2018-11-22 周四 02:19 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>单例模式</title>
<meta name="generator" content="Org mode">
<meta name="author" content="孙悟空">
<link rel='stylesheet' href='/asset/common.css' />



</head>
<body>
<div id="content">
<header>
<h1 class="title">单例模式</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3385d96">1. 饿汉模式</a></li>
<li><a href="#org130b750">2. 懒汉模式以及演进</a></li>
<li><a href="#orgae2f57e">3. 静态内部类方式</a></li>
<li><a href="#org69e1cb0">4. ENUM方式</a></li>
</ul>
</div>
</nav>
<p>
为什么:
</p>
<ul class="org-ul">
<li>逻辑上，一个公司只能有一个老板</li>
<li>效率上，尽量少实例化对象避免空间占用</li>
<li>其他</li>
</ul>

<section id="outline-container-org3385d96" class="outline-2">
<h2 id="org3385d96"><span class="section-number-2">1</span> 饿汉模式</h2>
<div class="outline-text-2" id="text-1">
<p>
最基本的思路，就是将类的构造器私有化，那么就不能在外部调用 new 创建实例了。
</p>

<p>
其次，通过调用静态方法获取实例。
</p>

<div class="org-src-container">
<pre class="src src-java"><span class="org-comment-delimiter">// </span><span class="org-comment">&#19968;&#33324;&#24773;&#20917;&#26469;&#35828;&#65292;&#36825;&#31181;&#26041;&#24335;&#23601;&#22815;&#29992;&#20102;&#65281;</span>

<span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">Boss</span> {
    <span class="org-keyword">private</span> <span class="org-function-name">Boss</span>() {}

    <span class="org-keyword">private</span> <span class="org-keyword">static</span> <span class="org-type">Boss</span> <span class="org-variable-name">instance</span> = <span class="org-keyword">new</span> <span class="org-type">Boss</span>();

    <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">Boss</span> <span class="org-function-name">getInstance</span>() {
        <span class="org-keyword">return</span> instance;
    }
}
</pre>
</div>
</div>
</section>

<section id="outline-container-org130b750" class="outline-2">
<h2 id="org130b750"><span class="section-number-2">2</span> 懒汉模式以及演进</h2>
<div class="outline-text-2" id="text-2">
<p>
饿汉模式的问题在于，即使没有用到 boss，它也会被实例化，有些浪费空间&#x2026;
</p>

<p>
而懒汉模式就是让 boss 只在用到的时候才去加载。
</p>

<p>
其设计的思路及代码如下:
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">Boss</span> {
    <span class="org-comment-delimiter">// </span><span class="org-comment">1. &#31169;&#26377;&#21270;&#26500;&#36896;&#22120;</span>
    <span class="org-keyword">private</span> <span class="org-type">Boss</span> {}

    <span class="org-comment-delimiter">// </span><span class="org-comment">2. &#23450;&#20041;&#23454;&#20363;&#30340;&#21464;&#37327;</span>
    <span class="org-keyword">private</span> <span class="org-keyword">static</span> <span class="org-type">Boss</span> <span class="org-variable-name">instance</span>;

    <span class="org-comment-delimiter">// </span><span class="org-comment">3. &#36890;&#36807;&#38745;&#24577;&#26041;&#27861;&#21019;&#24314;&#25110;&#36820;&#22238;&#23454;&#20363;</span>
    <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">Boss</span> <span class="org-function-name">getInstance</span> () {
        <span class="org-keyword">if</span> (instance == <span class="org-constant">null</span>) {
            instance = <span class="org-keyword">new</span> <span class="org-type">Boss</span>();  <span class="org-comment-delimiter">// </span><span class="org-comment">&#34429;&#28982;&#26500;&#36896;&#22120;&#26159;&#31169;&#26377;&#30340;&#65292;&#20294;&#26159;&#21487;&#20197;&#22312;&#20869;&#37096;&#35843;&#29992;</span>
        }
        <span class="org-keyword">return</span> instance;
    }
}
</pre>
</div>

<p>
这种方法在单线程下没有任何问题，但是在多线程环境中，却可能会实例化出多个对象。也就是说，它并不是线程安全的。为了解决这个问题，需要对 getInstance 加锁:
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">Boss</span> {
    <span class="org-comment-delimiter">// </span><span class="org-comment">1. &#31169;&#26377;&#21270;&#26500;&#36896;&#22120;</span>
    <span class="org-keyword">private</span> <span class="org-type">Boss</span> {}

    <span class="org-comment-delimiter">// </span><span class="org-comment">2. &#23450;&#20041;&#23454;&#20363;&#30340;&#21464;&#37327;</span>
    <span class="org-keyword">private</span> <span class="org-keyword">static</span> <span class="org-type">Boss</span> <span class="org-variable-name">instance</span>;

    <span class="org-comment-delimiter">// </span><span class="org-comment">3. &#36890;&#36807;&#38745;&#24577;&#26041;&#27861;&#21019;&#24314;&#25110;&#36820;&#22238;&#23454;&#20363;</span>
    <span class="org-keyword">public</span> <span class="org-keyword">synchronized</span> <span class="org-keyword">static</span> <span class="org-type">Boss</span> <span class="org-function-name">getInstance</span> () { <span class="org-comment-delimiter">// </span><span class="org-comment">&#36890;&#36807;&#38145;&#65292;&#23558;&#23545;&#27492;&#26041;&#27861;&#30340;&#35843;&#29992;&#21464;&#25104;&#20018;&#34892;&#30340;&#12290;&#36825;&#23601;&#38450;&#27490;&#20102;&#38169;&#35823;</span>
        <span class="org-keyword">if</span> (instance == <span class="org-constant">null</span>) {
            instance = <span class="org-keyword">new</span> <span class="org-type">Boss</span>();  <span class="org-comment-delimiter">// </span><span class="org-comment">&#34429;&#28982;&#26500;&#36896;&#22120;&#26159;&#31169;&#26377;&#30340;&#65292;&#20294;&#26159;&#21487;&#20197;&#22312;&#20869;&#37096;&#35843;&#29992;</span>
        }
        <span class="org-keyword">return</span> instance;
    }
}
</pre>
</div>

<p>
上述加锁的方式，可以保证正确实例化对象。但是，因为在方法上加了锁，使得获取单例对象的效率过低。这时候，需要兼顾线程安全和效率，就出现了<b>双重检查锁</b>的概念:
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-comment-delimiter">// </span><span class="org-comment">1. &#23558;&#26500;&#36896;&#22120;&#31169;&#26377;&#21270;</span>
<span class="org-keyword">private</span> <span class="org-function-name">Boss</span>() {}

<span class="org-comment-delimiter">// </span><span class="org-comment">2. &#21021;&#22987;&#21270;&#19968;&#20010;&#38745;&#24577;&#21464;&#37327;</span>
<span class="org-keyword">private</span> <span class="org-keyword">static</span> <span class="org-keyword">volatile</span> <span class="org-type">Boss</span> <span class="org-variable-name">instance</span> = <span class="org-constant">null</span>;

<span class="org-comment-delimiter">// </span><span class="org-comment">3. &#26500;&#36896;&#19968;&#20010;&#38745;&#24577;&#26041;&#27861;&#65292;&#36890;&#36807;&#23427;&#21021;&#22987;&#21270;&#25110;&#36820;&#36824;&#23545;&#35937;</span>
<span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">Boss</span> <span class="org-function-name">getInstance</span>() {
    <span class="org-comment-delimiter">// </span><span class="org-comment">&#21452;&#37325;&#26816;&#26597;&#38145;&#26426;&#21046;</span>
    <span class="org-keyword">if</span> (instance == <span class="org-constant">null</span>) {
        <span class="org-keyword">synchronized</span> (Boss.<span class="org-keyword">class</span>) {
            <span class="org-keyword">if</span> (instance == <span class="org-constant">null</span>) {
                instance = <span class="org-keyword">new</span> <span class="org-type">Boss</span>();
            }
        }
    }
    <span class="org-keyword">return</span> instance;
}
</pre>
</div>

<p>
其中:
</p>
<ul class="org-ul">
<li><code>synchronized</code> 块尽量缩小了锁定的范围，提高效率</li>
<li><code>volatile</code> 是为防止编译器指令重排而导致双重检查锁失效</li>
</ul>

<p>
另外:
</p>
<ul class="org-ul">
<li><b>指令重排</b>本是为了优化代码执行效率而存在的，虽然在单线程中效果拔群，但是在多线程中却能带来麻烦。<code>volatile</code> 可以要求编译器不要做指令重排。</li>
</ul>
</div>
</section>

<section id="outline-container-orgae2f57e" class="outline-2">
<h2 id="orgae2f57e"><span class="section-number-2">3</span> 静态内部类方式</h2>
<div class="outline-text-2" id="text-3">
<p>
这是相对来说，非常优秀的一种实现。在很多地方，推荐使用这种方式。
</p>

<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">Boss</span> {
    <span class="org-comment-delimiter">// </span><span class="org-comment">1. &#23558;&#26500;&#36896;&#22120;&#31169;&#26377;&#21270;</span>
    <span class="org-keyword">private</span> <span class="org-function-name">Boss</span>() { }

    <span class="org-comment-delimiter">// </span><span class="org-comment">2. &#20805;&#20998;&#21033;&#29992;&#20102;&#38745;&#24577;&#20869;&#37096;&#31867;&#30340;&#29305;&#24615;&#65292;&#22312;&#37324;&#38754;&#21021;&#22987;&#21270; Boss &#23454;&#20363;</span>
    <span class="org-comment-delimiter">//    </span><span class="org-comment">- &#21482;&#20250;&#34987;&#21021;&#22987;&#21270;&#19968;&#27425;</span>
    <span class="org-comment-delimiter">//    </span><span class="org-comment">- &#21482;&#26377;&#24403;&#38745;&#24577;&#20869;&#37096;&#31867;&#20869;&#37096;&#30340;&#23646;&#24615;&#12289;&#26041;&#27861;&#31561;&#34987;&#35843;&#29992;&#30340;&#26102;&#20505;&#65292;&#38745;&#24577;&#20869;&#37096;&#31867;&#25165;&#20250;&#34987;&#21152;&#36733;</span>
    <span class="org-keyword">static</span> <span class="org-keyword">class</span> <span class="org-type">Singleton</span> {
        <span class="org-keyword">private</span> <span class="org-keyword">final</span> <span class="org-keyword">static</span> <span class="org-type">Boss</span> <span class="org-variable-name">INSTANCE</span> = <span class="org-keyword">new</span> <span class="org-type">Boss</span>();
    }

    <span class="org-comment-delimiter">// </span><span class="org-comment">3. &#25552;&#20379;&#19968;&#20010;&#20844;&#20849;&#26041;&#27861;&#65292;&#33719;&#21462;&#23454;&#20363;&#21270;&#22909;&#20043;&#21518;&#30340;&#23545;&#35937;</span>
    <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">Boss</span> <span class="org-function-name">getInstance</span>() {
        <span class="org-keyword">return</span> <span class="org-constant">Singleton</span>.INSTANCE;
    }
}
</pre>
</div>
</div>
</section>

<section id="outline-container-org69e1cb0" class="outline-2">
<h2 id="org69e1cb0"><span class="section-number-2">4</span> ENUM方式</h2>
<div class="outline-text-2" id="text-4">
<p>
ENUM 应该是最<b>简单</b>，也是<b>最好</b>的一种实现单例模式的方式。
</p>

<p>
它充分利用了 JVM 的特性，既保证了线程安全，又保证了延迟加载。
</p>

<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">enum</span> <span class="org-type">Boss</span> {
    <span class="org-variable-name">INSTANCE</span>;

    <span class="org-keyword">public</span> <span class="org-type">void</span> <span class="org-function-name">sayHello</span> () {
        System.out.println(<span class="org-string">"hello"</span>);
    }
}

<span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">Main</span> {
    <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">main</span> (<span class="org-type">String</span>... <span class="org-variable-name">args</span>) {
        <span class="org-type">Boss</span> <span class="org-variable-name">theBoss</span> = <span class="org-constant">Boss</span>.INSTANCE;  <span class="org-comment-delimiter">// </span><span class="org-comment">&#33719;&#21462;&#23454;&#20363;</span>
        theBoss.sayHello();            <span class="org-comment-delimiter">// </span><span class="org-comment">&#35843;&#29992;&#26041;&#27861;</span>
    }
}
</pre>
</div>

<p>
更多，如果感兴趣，自己学习整理
</p>
</div>
</section>
</div>
<div id="postamble" class="status">
<p class="author">Author: 孙悟空</p>
<p class="date">Created: 2018-11-22 周四 02:19</p>
<p class="validation">Go ahead, never stop.</p>
</div>
</body>
</html>
